print("โปรแกรมหาค่าสมการไดโอแฟนไทน์เชิงเส้น")
print("จากสมการ ax + by = c")
a = int(input("รับค่า A : "))
b = int(input("รับค่า B : "))
c = int(input("รับค่า C : "))
at = a  # เก็บสำเนา a
bt = b  # เก็บสำเนา b
if c % a == 0 or c % b == 0:    # ตรวจสอบว่ามีคำตอบหรือไม่
    print(a, "x +", b, "y =", c, ": มีคำตอบ")
    anwa = []   # เก็บค่า b/a เพื่อนำไปคำนวณหา s และ t

    if a == 0:  # หาค่า gcd
        b = 1
        print("GCD is  ", b)
    else:
        while a != 0:
            x1 = int(b / a)     # เก็บค่า b/a ของแต่ละช่วง
            anwa.append(x1)     # เก็บค่า b/a ของแต่ละช่วงลงใน list
            b1 = a
            a = b - (int((b / a)) * a)  # คำนวณหาค่า a
            b = b1  # คำหนดค่า b
        print("GCD is", b)  #ค่า d = b
    s = 0
    t = 1
    i = len(anwa)   # นับจำนวนตัวแปรที่อยู่ใน list
    i = i - 1       # นำจำนวนตัวแปรที่อยู่ใน list มา -1 เพื่อที่จะกำหนดตำแหน่ง 0-n

    while i != -1:  # คำนวณหาค่า s t โดยนำค่า [b/a] มาจาก list ที่เก็บค่าไว้
        t1 = s
        s1 = t - (anwa[i] * s)
        t = t1
        s = s1
        i = i - 1
        """
        print(s," ",t)
        """

    print("a =", at, "; b =", bt, "; s =", s, "; t =", t, "; gcd =", b)

    x0 = int((s * c) / b)
    y0 = int((t * c) / b)
    x1 = x0
    y1 = y0
    b0 = bt / b
    b1 = at / b

    print(x0, y0, b0, b1)


    if x0 < 0:  # กลับค่าเพื่อนำไปคำนวณหาค่า n
        x0 = -x0
    if y0 < 0:  # กลับค่าเพื่อนำไปคำนวณหาค่า n
        y0 = -y0
    """
    print(x0, y0, x1, y1, b0, b1)
    """
    n1 = int(x0 / b0)   # คำนวณหาค่า n
    n2 = int(y0 / b1)   # คำนวณหาค่า n
    """
    print(n1, n2)
    """

    n = []  # สร้าง list เพื่อที่จะมาเก็บค่า n

    if n2 > n1:
        # กำหนดสลับค่าให้ n1 เป็นค่า n ที่มาก และให้ n1 เป็นค่า n ที่น้อย เพื่อให้ข้อมูลที่ส่งไป List เรียงจากน้อยไปมาก
        i = n1
        n1 = n2
        n2 = i

    while n2 < n1 + 1:
        # เก็บค่า n ทั้งหมดลงใน list n
        n.append(n2)
        n2 += 1

    print(b,s,t,x1,y1)


    print("=" * 16)     # สร้างเครื่องหมาย = 16 อัน
    print("x", " " * 10, "y")
    for xx in n:    # สร้างลูปกำหนดตัวแปร xx เท่ากับตัวแปรที่อยู่ใน list n
        x = int(x1 + (b0 * xx))
        y = int(y1 - (b1 * xx))
        if (bt*y)+(at*x) == c:  # ลองแทน x และ y เข้าไปในสมการหากสมการเป็นจริงให้ทำต่อ
            if x >= 0 and y >= 0:   # ค่า x และ y ต้องไม่ติดลบ
                print(x, " "*10, y)
    print("=" * 16)     # สร้างเครื่องหมาย = 16 อัน

else:
    print(a, "x +", b, "y =", c, ": ไม่มีคำตอบ")



